In [10]:
import pandas as pd
import os

In [11]:
path = os.path.join('OriginalData', 'work_experiences.csv')
data = pd.read_csv(path)

In [12]:
data

        user_id  company_id           location  start_year_month
0         53442        2651   Istanbul, Turkey            201509
1         34558         815   Istanbul, Turkey            201210
2         63761       26354                NaN            200010
3         10738          89                NaN            201610
4          8711        3113   Istanbul, Turkey            201801
...         ...         ...                ...               ...
187014    22180       15065              Gebze            201205
187015    55822       25076             stajer            201506
187016    13750        1607                NaN            201901
187017     3679        1414     Ankara, Turkey            201807
187018    40056       14626  İstanbul, Türkiye            201303

[187019 rows x 4 columns]

In [13]:
# Create a new column called "companies_changed" for each user_id
# This column will be the amount of companies the user has changed
data['companies_changed'] = data.groupby('user_id')['company_id'].transform('nunique')

In [14]:
# Save the data to a new csv file, but in PreparedData folder
data.to_csv(os.path.join('PreparedData', 'work_experiences.csv'), index=False)